<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<title>
EBX5 documentation - Notions cl&eacute;s</title>
<meta content="text/html; charset=UTF-8" http-equiv="content-type"></meta><meta content="Copyright Orchestra Networks 2000-2013. All rights reserved." name="copyright"></meta><meta content="howitworks" name="doc_id"></meta><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_common.css"></link><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_docPage.css"></link><link rel="icon" type="image/x-icon" href="../resources/icons/brand.ico"></link></head>
<body class="ebx_simplePage">
<div id="ebx_centerer">
<div id="ebx_main">
<div id="printHeader">
<div class="productName">
EBX5</div>
<div class="chapterName">
Documentation de EBX5 &gt; Guide utilisateur &gt; Introduction</div>
</div>
<div id="ebx_breadcrumbTop">
<a id="ebx_navigationModeButton" href="../index.html?page=user_introduction/howitworks.html" title="Afficher cette page avec l'en-tête et les panneaux de navigation">Mode navigation</a><span class="ebx_breadcrumbLabel">Documentation de EBX5 &gt; Guide utilisateur &gt; Introduction</span></div>
<h1>
Notions cl&eacute;s</h1>
<div id="toc">
<h4 id="tocTitle">
Contenu de la section</h4>
<ul class="toc1">
<li class="toc1"><a href="#id1">Concepts et outils associés</a></li><li class="toc1"><a href="#architecture">Architecture</a></li></ul>
</div>
<h2>
<a name="id1"></a>Concepts et outils associ&eacute;s</h2>
<p align="center"><img alt="/MDM.png" src="../resources/images/user_introduction/MDM.png"></img></p><p> La gestion des donn&eacute;es de r&eacute;f&eacute;rence (plus connue sous l&#39;acronyme MDM pour Master Data Management) est un moyen de mieux mod&eacute;liser, g&eacute;rer et ultimement gouverner vos donn&eacute;es partag&eacute;es. La duplication des donn&eacute;es au sein de plusieurs syst&egrave;mes informatiques et son partage par des &eacute;quipes professionnelles multiples rend critique le besoin d&#39;avoir une version unique et une gouvernance de vos donn&eacute;es de r&eacute;f&eacute;rence.</p><p>Avec EBX5, les utilisateurs m&eacute;tier et les informaticiens peuvent collaborer sur une seule et unique solution unifi&eacute;e de mani&egrave;re &agrave; concevoir des mod&egrave;les de donn&eacute;es et g&eacute;rer le contenu des donn&eacute;es de r&eacute;f&eacute;rence.</p><p>EBX5 est un logiciel de gestion des donn&eacute;es de r&eacute;f&eacute;rence qui permet de mod&eacute;liser tout type de donn&eacute;es de r&eacute;f&eacute;rence et d&#39;y appliquer une gouvernance gr&acirc;ce &agrave; des outils avanc&eacute;s comme le workflow collaboratif, le contr&ocirc;le de l&#39;&eacute;dition des donn&eacute;es, la gestion hi&eacute;rarchique des donn&eacute;es, le contr&ocirc;le de version, et la s&eacute;curit&eacute;.</p><p>Un projet MDM sur EBX5 commence par la cr&eacute;ation d&#39;un mod&egrave;le de donn&eacute;es. C&#39;est l&agrave; que vous d&eacute;finissez les tables, les champs, les liens et les r&egrave;gles m&eacute;tier permettant de d&eacute;crire vos donn&eacute;es de r&eacute;f&eacute;rence. De bons exemples sont les catalogues de produits, les hi&eacute;rarchies financi&egrave;res, la liste des fournisseurs ou simplement les tables de r&eacute;f&eacute;rence.</p><p>Votre mod&egrave;le de donn&eacute;es peut ensuite &ecirc;tre publi&eacute; en tant que jeu de donn&eacute;es, stockant le contenu actuel de vos donn&eacute;es de r&eacute;f&eacute;rence. Un jeu de donn&eacute;es se trouve dans un espace de donn&eacute;es. Un espace de donn&eacute;es est un conteneur, qui permet d&#39;isoler des mises &agrave; jour&nbsp;;&nbsp;cela est tr&egrave;s utile si vous avez besoin de travailler sur plusieurs versions parall&egrave;les de vos donn&eacute;es, de r&eacute;aliser une analyse d&#39;impact ou de travailler en &quot;espaces de d&eacute;monstration&quot;.</p><p>Une fois que tout est pr&ecirc;t &agrave; l&#39;emploi, vous pouvez d&eacute;finir des processus de gestion des donn&eacute;es, que vous allez exprimer sous forme de mod&egrave;les de workflow dans EBX5. Ces mod&egrave;les d&eacute;taillent les t&acirc;ches &agrave; accomplir ainsi que les responsabilit&eacute;s associ&eacute;es. Apr&egrave;s publication de ces mod&egrave;les, il sont disponibles &agrave; l&#39;usage sous forme de workflows. </p><p>Les workflows sont de grande valeur si vous avez besoin de r&eacute;aliser une gestion contr&ocirc;l&eacute;e du changement ou une validation des donn&eacute;es pas &agrave; pas impliquant des utilisateurs multiples. Une fois d&eacute;marr&eacute;s, des notifications sont envoy&eacute;es aux utilisateurs sur le nombre de bons de travail mis &agrave; leur disposition dans un contexte de travail collaboratif. </p><p>Les services de donn&eacute;es aide &agrave; int&eacute;grer EBX5 &agrave; des syst&egrave;mes tiers (middlewares), en leur permettant d&#39;acc&eacute;der aux donn&eacute;es, ou de g&eacute;rer des espaces de donn&eacute;es et/ou des workflows.</p><p>Les mots-cl&eacute;s &agrave; comprendre sont :</p><ul>
<li><p><a target="_self" href="../glossary/simple_glossary.html#datamodels">Mod&egrave;le de donn&eacute;es</a></p></li><li><p><a target="_self" href="../glossary/simple_glossary.html#data">Jeu de donn&eacute;es</a></p></li><li><p><a target="_self" href="../glossary/simple_glossary.html#dataspaces">Espace de donn&eacute;es</a></p></li><li><p><a target="_self" href="../glossary/simple_glossary.html#workflowmodels">Mod&egrave;le de workflow</a></p></li><li><p><a target="_self" href="../glossary/simple_glossary.html#workflows">Workflow de donn&eacute;es</a></p></li><li><p><a target="_self" href="../glossary/simple_glossary.html#dataservices">Service de donn&eacute;es</a></p></li></ul>
<p>Des d&eacute;finitions d&eacute;taill&eacute;es peuvent &ecirc;tre trouv&eacute;es dans notre <a target="_self" href="../glossary/simple_glossary.html">glossaire</a>.</p><h2>
<a name="architecture"></a>Architecture</h2>
<p>Le sch&eacute;ma suivant pr&eacute;sente l&#39;architecture de EBX5.</p><p align="center"><img alt="/architecture.png" src="../resources/images/user_introduction/architecture.png"></img></p><p class="noPrint" align="right"><em><img alt="/ebx_search.png" src="../resources/images/symbols/ebx_search.png"></img><a target="_self" href="../table_contents_user.html">Sommaire</a></em> du guide utilisateur</p><div id="ebx_breadcrumbBottom">
<span class="ebx_breadcrumbLabel">Documentation de EBX5 &gt; Guide utilisateur &gt; Introduction</span></div>
</div>
<p id="ebx_footer"><b>EBX5 Version 5.4.0 Fix 002 [0907:0001]. </b>Copyright &copy; <a href="http://www.orchestranetworks.com" target="_blank" style="text-decoration: none;">Orchestra Networks</a> 2000-2013. All rights reserved.<br></br>Trademarks and brand names referred to in this web site relating to organizations other than Orchestra Networks are the property of those organizations and Orchestra Networks makes no claims to such property.</p></div>
<script type="text/javaScript" src="../resources/yui/yahoo/yahoo-min.js">
</script>
<script type="text/javaScript" src="../resources/yui/event/event-min.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_doc_utils.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_simplePage.js">
</script>
<script type="text/javaScript">
var ie6CompatibilityCSSURL = "../resources/stylesheets/ebx_ie6_compatibility.css";</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_ie6_compatibility.js">
</script>
</body>
</html>
