<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<title>
EBX5 documentation - Actions principales</title>
<meta content="text/html; charset=UTF-8" http-equiv="content-type"></meta><meta content="Copyright Orchestra Networks 2000-2013. All rights reserved." name="copyright"></meta><meta content="dataspace" name="doc_id"></meta><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_common.css"></link><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_docPage.css"></link><link rel="icon" type="image/x-icon" href="../resources/icons/brand.ico"></link></head>
<body class="ebx_simplePage">
<div id="ebx_centerer">
<div id="ebx_main">
<div id="printHeader">
<div class="productName">
EBX5</div>
<div class="chapterName">
Documentation de EBX5 &gt; Guide utilisateur &gt; Espaces de données</div>
</div>
<div id="ebx_breadcrumbTop">
<a id="ebx_navigationModeButton" href="../index.html?page=user_dataspace/actions_dataspace.html" title="Afficher cette page avec l'en-tête et les panneaux de navigation">Mode navigation</a><span class="ebx_breadcrumbLabel">Documentation de EBX5 &gt; Guide utilisateur &gt; Espaces de données</span></div>
<h1>
Actions principales</h1>
<div id="toc">
<h4 id="tocTitle">
Contenu de la section</h4>
<ul class="toc1">
<li class="toc1"><a href="#creation">Création d'un espace de données</a></li><li class="toc1"><a href="#information">Edition de l'espace de données</a><ul class="toc2">
<li class="toc2"><a href="#id2s1">Informations</a></li><li class="toc2"><a href="#validate">Validation</a></li><li class="toc2"><a href="#export">Exporter une archive</a></li><li class="toc2"><a href="#import">Importer une archive</a></li><li class="toc2"><a href="#merge">Fusion</a></li><li class="toc2"><a href="#snapshot">Image</a></li><li class="toc2"><a href="#permissions">Permissions</a></li></ul>
</li><li class="toc1"><a href="#closing">Fermeture d'un espace de données</a></li></ul>
</div>
<h2>
<a name="creation"></a>Cr&eacute;ation d&#39;un espace de donn&eacute;es</h2>
<p>Vous pouvez cr&eacute;er un nouvel espace de donn&eacute;es en utilisant le bouton <em>Cr&eacute;er un espace de donn&eacute;es</em> situ&eacute; dans l&#39;espace de travail. L&#39;espace de donn&eacute;es nouvellement cr&eacute;&eacute; devient un sous-espace de donn&eacute;es de celui qui &eacute;tait s&eacute;lectionn&eacute; et le contenu de son parent est virtuellement dupliqu&eacute; dans le nouvel espace de donn&eacute;es. Les informations suivantes sont requises&nbsp;:&nbsp;</p><table class="ebx_definitionList">
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Identifiant</p></td><td class="ebx_definitionListDefinition"><p>Identifiant unique de l&#39;espace de donn&eacute;es.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Propri&eacute;taire</p></td><td class="ebx_definitionListDefinition"><p>Utilisateur poss&eacute;dant l&#39;espace de donn&eacute;es et &eacute;tant autoris&eacute; &agrave; en modifier les informations et les permissions, qui n&#39;est pas obligatoirement son cr&eacute;ateur.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Libell&eacute;</p></td><td class="ebx_definitionListDefinition"><p>Libell&eacute; et description associ&eacute;s &agrave; l&#39;espace de donn&eacute;es en plusieurs langues.</p></td></tr>
</table>
<h2>
<a name="information"></a>Edition de l&#39;espace de donn&eacute;es</h2>
<h3>
<a name="id2s1"></a>Informations</h3>
<p>Vous pouvez modifier les information associ&eacute;es &agrave; l&#39;espace de donn&eacute;es &agrave; l&#39;aide du bouton <em>Actions</em>.</p><table class="ebx_definitionList">
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Propri&eacute;taire</p></td><td class="ebx_definitionListDefinition"><p>Personne poss&eacute;dant l&#39;espace de donn&eacute;es et &eacute;tant autoris&eacute;e &agrave; en modifier les informations et les permissions, qui n&#39;est pas obligatoirement son cr&eacute;ateur.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Documentation</p></td><td class="ebx_definitionListDefinition"><p>Libell&eacute; et description associ&eacute;s &agrave; l&#39;espace de donn&eacute;es en plusieurs langues.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Changement de propri&eacute;taire</p></td><td class="ebx_definitionListDefinition"><p>Modification de l&#39;attribut <em>Propri&eacute;taire</em> par le propri&eacute;taire d&#39;un espace de donn&eacute;es. En son absence, seul l&#39;administrateur a le droit d&#39;effectuer cette modification.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Changement des permissions</p></td><td class="ebx_definitionListDefinition"><p>Modification des permissions par le propri&eacute;taire d&#39;un espace de donn&eacute;es. En son absence, seul l&#39;administrateur a le droit d&#39;effectuer cette modification.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Strat&eacute;gie de chargement</p></td><td class="ebx_definitionListDefinition"><p>Seul l&#39;administrateur a le droit de modifier cette option.</p><ul>
<li><p><strong>Chargement et d&eacute;chargement sur demande :</strong> est le mode par d&eacute;faut. Le principal avantage est la capacit&eacute; de lib&eacute;rer de la m&eacute;moire si n&eacute;cessaire. L&#39;inconv&eacute;nient est que cela implique un co&ucirc;t de chargement, quand une ressource acc&eacute;d&eacute;e n&#39;a pas encore &eacute;t&eacute; charg&eacute;e depuis le d&eacute;marrage du serveur ou si elle a &eacute;t&eacute; d&eacute;charg&eacute;e entre-temps.</p></li><li><p><strong>Chargement forc&eacute; :</strong> ce mode est particuli&egrave;rement recommand&eacute; pour les espaces de donn&eacute;es &agrave; longue dur&eacute;e de vie et les images, qui sont fr&eacute;quemment utilis&eacute;es.</p></li><li><p><strong>Chargement forc&eacute; et pr&eacute;-validation :</strong> ce mode est particuli&egrave;rement recommand&eacute; pour les espaces de donn&eacute;es &agrave; longue dur&eacute;e de vie et les images, qui sont fr&eacute;quemment utilis&eacute;es et pour lesquelles le processus de validation peut &ecirc;tre long.</p></li></ul>
<p><strong>Note :</strong> Toute modification de la strat&eacute;gie de chargement requiert un red&eacute;marrage du serveur.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><a name="mergePolicy"></a><p>Politique de fusion</p></td><td class="ebx_definitionListDefinition"><p>La politique de fusion des espaces de donn&eacute;es enfants ne s&#39;applique qu&#39;au fusion initi&eacute; par un utilisateur. Elle ne s&#39;applique aux fusions programatiques (ex: script de workflow).</p><p>Les politiques possibles sont :</p><ul>
<li><p><strong>Autoriser des erreurs de validation dans le r&eacute;sultat :</strong> c&#39;est la politique par d&eacute;faut. Un espace de donn&eacute;es enfant peut &ecirc;tre fusionn&eacute; quelque soit la validit&eacute; du r&eacute;sultat de cette fusion.</p></li><li><p><strong>Fusion pr&eacute;-validante :</strong> un espace de donn&eacute;es enfant peut &ecirc;tre fusionn&eacute; si et seulement si le r&eacute;sultat de la fusion est valide.</p></li></ul>
</td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Tri des espaces enfants</p></td><td class="ebx_definitionListDefinition"><a name="childSortPolicy"></a><p>D&eacute;finit l&#39;ordre d&#39;affichage des espaces de donn&eacute;es enfants dans l&#39;arbre des espaces de donn&eacute;es. Si non d&eacute;fini, l&#39;ordre d&eacute;fini par le parent est pris en compte. La valeur par d&eacute;faut est &quot;par libell&eacute;&quot;.</p></td></tr>
</table>
<h3>
<a name="validate"></a>Validation</h3>
<p>Le contenu d&#39;un espace de donn&eacute;es peut &ecirc;tre valid&eacute; d&#39;un coup en utilisant le service validation au niveau espace de donn&eacute;es. Ce service est accessible par le bouton <em>Actions</em> dans l&#39;espace de travail.</p><p><strong>Note :</strong> Pour utiliser ce service, l&#39;utilisateur doit avoir la permission de valider chaque jeu de donn&eacute;es contenus dans l&#39;espace de donn&eacute;es.</p><h3>
<a name="export"></a>Exporter une archive</h3>
<p>Le contenu d&#39;un espace de donn&eacute;es peut &ecirc;tre export&eacute; au sein d&#39;une archive en utilisant le service accessible via le bouton <em>Actions</em>.</p><p><strong>Note :</strong> L&#39;administrateur doit r&eacute;cup&eacute;rer l&#39;archive export&eacute;e. Voir <a target="_self" href="../engine/repository_administration.html#archive">Archives directory</a> dans le Guide d&#39;administration.</p><p>Pour r&eacute;aliser un export, trois informations sont requises:</p><ul>
<li><p><strong>Nom du fichier archive :</strong> champ texte permettant de renseigner le nom souhait&eacute;.</p></li><li><p><strong>Type d&#39;export :</strong> Obligatoire.</p><p>Le type d&#39;export par d&eacute;faut est <strong>Le contenu complet de l&#39;espace de donn&eacute;es</strong>, celui ci exporte l&#39;ensemble des donn&eacute;es s&eacute;lectionn&eacute;es dans l&#39;archive. Si vous travaillez dans un espace de donn&eacute;es en fait, il peut &ecirc;tre int&eacute;ressant de comparer l&#39;espace de donn&eacute;es avec son p&egrave;re et d&#39;inclure dans l&#39;archive les diff&eacute;rences, sous la forme d&#39;un delta.</p><p>Deux types d&#39;export permettent de le r&eacute;aliser&nbsp;:&nbsp;<strong>Mises &agrave; jour avec leur contenu complet </strong> et <strong>Mises &agrave; jour seules </strong>. Le premier exporte tout les donn&eacute;es et le delta tandis que le second n&#39;exporte les donn&eacute;es que si une diff&eacute;rence est d&eacute;finie dans le delta. La granularit&eacute; d&#39;export est le niveau table. L&#39;&eacute;cran de comparaison permet de s&eacute;lectionner les diff&eacute;rences &agrave; inclure dans le delta.</p></li><li><p><strong>Jeu de donn&eacute;es &agrave; exporter :</strong> la table permet de s&eacute;lectionner les jeux de donn&eacute;es qui doivent &ecirc;tre export&eacute;s. Pour chaque jeu de donn&eacute;e, il est possible de choisir si les donn&eacute;es, les permissions et les informations doivent &ecirc;tre export&eacute;s.</p></li></ul>
<h3>
<a name="import"></a>Importer une archive</h3>
<p>Le contenu d&#39;une archive peut &ecirc;tre import&eacute; dans un espace de donn&eacute;es en utilisant le service accessible via le bouton <em>Actions</em>.</p><p>Si l&#39;archive s&eacute;lectionn&eacute;e contient un delta, vous pouvez choisir de l&#39;utiliser. L&#39;&eacute;cran de comparaison vous permet de s&eacute;lectionner les diff&eacute;rences du delta qui doivent &ecirc;tre import&eacute;es.</p><h3>
<a name="merge"></a>Fusion</h3>
<p>Des changements &agrave; un espace de donn&eacute;es peuvent &ecirc;tre appliqu&eacute;s &agrave; son parent en utilisant la fonction <em>fusionner</em>, gr&acirc;ce au bouton <em>Actions</em>. Le processus compare les diff&eacute;rences entre les deux espace de donn&eacute;es &agrave; fusionner, puis demande &agrave; l&#39;utilisateur d&#39;arbitrer les conflits &eacute;ventuels.</p><p>Pour plus de d&eacute;tails, sur le d&eacute;roulement des fusions, lisez la page <a target="_self" href="./merge.html">Fusion</a>.</p><h3>
<a name="snapshot"></a>Image</h3>
<p>Cr&eacute;&eacute;r une image est un moyen de sauvegarder un &eacute;tat exact et en lecture seule de votre espace de donn&eacute;es &agrave; un instant <em>t</em>, avant d&#39;y appliquer tout changement majeur. L&#39;image fig&eacute;e de votre espace de r&eacute;f&eacute;rence devient un point de rep&egrave;re pour vous, au cas o&ugrave; vous auriez besoin d&#39;annuler des changements.</p><p>Pour trouver comment faire une image de votre espace de donn&eacute;es, lire la page <a target="_self" href="./snapshot.html">Image</a>.</p><h3>
<a name="permissions"></a>Permissions</h3>
<p>Il est possible pour un propri&eacute;taire ou un administrateur de d&eacute;finir des droits d&#39;acc&egrave;s &agrave; un espace de donn&eacute;es (lecture seule, &eacute;criture ou non visible) et de les pr&eacute;ciser action par action de mani&egrave;re &agrave; prot&eacute;ger l&#39;espace de donn&eacute;es et son contenu de tout acc&egrave;s ou modification par des utilisateurs non autoris&eacute;s. Plus de pr&eacute;cisions sur les permissions et leur gestion, peuvent &ecirc;tre trouv&eacute;es &agrave; la page <a target="_self" href="../user_dataspace/userdataspace_permissions.html">Permissions</a>.</p><h2>
<a name="closing"></a>Fermeture d&#39;un espace de donn&eacute;es</h2>
<p>Si vous souhaitez abandonn&eacute; un espace de donn&eacute;es sans le fusionner, ce dernier peut tout simplement &ecirc;tre ferm&eacute; par son propri&eacute;taire ou tout utilisateur habilit&eacute;. Une fois ferm&eacute;, plus personne ne peut y acc&eacute;der. L&#39;espace de donn&eacute;es peut toutefois &ecirc;tre r&eacute;ouvert par un administrateur, sauf si celui-ci a d&eacute;j&agrave; &eacute;t&eacute; purg&eacute;.</p><p>Cela peut se faire &agrave; l&#39;aide du bouton <em>Actions</em>.</p><p class="noPrint" align="right"><em><img alt="/ebx_search.png" src="../resources/images/symbols/ebx_search.png"></img><a target="_self" href="../table_contents_user.html"> Sommaire</a></em> du guide utilisateur</p><div id="ebx_breadcrumbBottom">
<span class="ebx_breadcrumbLabel">Documentation de EBX5 &gt; Guide utilisateur &gt; Espaces de données</span></div>
</div>
<p id="ebx_footer"><b>EBX5 Version 5.4.0 Fix 002 [0907:0001]. </b>Copyright &copy; <a href="http://www.orchestranetworks.com" target="_blank" style="text-decoration: none;">Orchestra Networks</a> 2000-2013. All rights reserved.<br></br>Trademarks and brand names referred to in this web site relating to organizations other than Orchestra Networks are the property of those organizations and Orchestra Networks makes no claims to such property.</p></div>
<script type="text/javaScript" src="../resources/yui/yahoo/yahoo-min.js">
</script>
<script type="text/javaScript" src="../resources/yui/event/event-min.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_doc_utils.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_simplePage.js">
</script>
<script type="text/javaScript">
var ie6CompatibilityCSSURL = "../resources/stylesheets/ebx_ie6_compatibility.css";</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_ie6_compatibility.js">
</script>
</body>
</html>
