<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<title>
EBX5 documentation - Actions principales</title>
<meta content="text/html; charset=UTF-8" http-equiv="content-type"></meta><meta content="Copyright Orchestra Networks 2000-2013. All rights reserved." name="copyright"></meta><meta content="data_dataset" name="doc_id"></meta><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_common.css"></link><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_docPage.css"></link><link rel="icon" type="image/x-icon" href="../resources/icons/brand.ico"></link></head>
<body class="ebx_simplePage">
<div id="ebx_centerer">
<div id="ebx_main">
<div id="printHeader">
<div class="productName">
EBX5</div>
<div class="chapterName">
Documentation de EBX5 &gt; Guide utilisateur &gt; Jeux de données</div>
</div>
<div id="ebx_breadcrumbTop">
<a id="ebx_navigationModeButton" href="../index.html?page=user_data/actions_dataset.html" title="Afficher cette page avec l'en-tête et les panneaux de navigation">Mode navigation</a><span class="ebx_breadcrumbLabel">Documentation de EBX5 &gt; Guide utilisateur &gt; Jeux de données</span></div>
<h1>
Actions principales</h1>
<div id="toc">
<h4 id="tocTitle">
Contenu de la section</h4>
<ul class="toc1">
<li class="toc1"><a href="#creation">Création d'un jeu de données</a><ul class="toc2">
<li class="toc2"><a href="#information">Information</a></li></ul>
</li><li class="toc1"><a href="#id2">Édition du jeu de données</a><ul class="toc2">
<li class="toc2"><a href="#id2s1">Navigation dans le jeu de données</a></li><li class="toc2"><a href="#id2s2">Paramétrage des permissions</a></li></ul>
</li><li class="toc1"><a href="#validation">Validation du jeu de données</a></li><li class="toc1"><a href="#tables">Table de jeux de données</a><ul class="toc2">
<li class="toc2"><a href="#editRecord">Édition d'un enregistrement</a></li><li class="toc2"><a href="#sort">Tri des données</a></li><li class="toc2"><a href="#search">Recherche et filtrage des données</a></li><li class="toc2"><a href="#views">Vues personnalisées</a></li></ul>
</li></ul>
</div>
<h2>
<a name="creation"></a>Cr&eacute;ation d&#39;un jeu de donn&eacute;es</h2>
<p>Un jeu de donn&eacute;es peut &ecirc;tre cr&eacute;&eacute; &agrave; l&#39;aide du bouton <em>Cr&eacute;er un jeu de donn&eacute;es</em>, accessible &agrave; partir du s&eacute;lecteur de jeu de donn&eacute;es. S&#39;il n&#39;existe aucun jeu de donn&eacute;es dans l&#39;espace de donn&eacute;es s&eacute;lectionn&eacute;, le bouton s&#39;affiche directement dans le panneau de navigation. Un assistant vous permet alors de cr&eacute;er le jeu de donn&eacute;es.</p><h3>
<a name="information"></a>Information</h3>
<p>Les informations associ&eacute;es au jeu de donn&eacute;es peuvent &ecirc;tre &eacute;dit&eacute;es &agrave; l&#39;aide du bouton <em>Actions</em> dans le panneau de navigation. Les informations &eacute;ditables sont les suivantes :</p><ul>
<li><p><strong>Propri&eacute;taire :</strong> Utilisateur pouvant &eacute;diter ses informations et d&eacute;finir des r&egrave;gles de permissions sur le jeu de donn&eacute;es, qui n&#39;est pas obligatoirement son cr&eacute;ateur.</p></li><li><p><strong>Documentation :</strong> Libell&eacute; et description associ&eacute;s au jeu de donn&eacute;es dans diff&eacute;rentes langues.</p></li><li><p><strong>Activ&eacute; :</strong> Activation du jeu de donn&eacute;es n&eacute;cessaire &agrave; la s&eacute;lection de r&egrave;gles de validation.</p></li></ul>
<h2>
<a name="id2"></a>&Eacute;dition du jeu de donn&eacute;es</h2>
<h3>
<a name="id2s1"></a>Navigation dans le jeu de donn&eacute;es</h3>
<p>Dans un jeu de donn&eacute;es, vous pouvez trouver des tables, des champs et des groupes de l&#39;un et de l&#39;autre. Pour y acc&eacute;der, utilisez l&#39;arborescence du panneau de navigation et cliquez sur le jeu de donn&eacute;es qui vous int&eacute;resse. Son contenu s&#39;affiche dans l&#39;espace de travail.</p><h3>
<a name="id2s2"></a>Param&eacute;trage des permissions</h3>
<p>Pour savoir comment personnaliser les permissions pour chaque utilisateur potentiel, lisez attentivement la page <a target="_self" href="../user_data/userdata_permissions.html">permissions</a>.</p><h2>
<a name="validation"></a>Validation du jeu de donn&eacute;es</h2>
<p>Il est possible de valider un jeu de donn&eacute;es en s&eacute;lectionnant <strong>Actions &gt; Valider</strong> depuis le panneau de navigation. Les &eacute;ventuels messages issus de la validation du jeu de donn&eacute;es sont pr&eacute;sent&eacute;s dans un rapport. Depuis le rapport de validation, vous pouvez cliquer sur le bouton <strong>Revalider</strong> pour mettre &agrave; jour ce rapport, ou vous pouvez cliquer sur le bouton <strong>R&eacute;initialiser le rapport de validation</strong> pour supprimer tous les messages de validation actuellement associ&eacute;s au jeu de donn&eacute;es afin de pouvoir relancer une validation compl&egrave;te.</p><p>Dans la section Donn&eacute;es, vous pouvez &eacute;galement valider une table en s&eacute;lectionnant une table dans le panneau de navigation et en utilisant l&#39;action <strong>Actions &gt; Valider</strong> dans l&#39;espace de travail.</p><h2>
<a name="tables"></a>Table de jeux de donn&eacute;es</h2>
<p>Le contenu d&#39;une table s&#39;affiche dans l&#39;espace de travail, qui est aussi l&#39;endroit o&ugrave; l&#39;utilisateur peut interagir avec ce contenu.</p><h3>
<a name="editRecord"></a>&Eacute;dition d&#39;un enregistrement</h3>
<table class="ebx_definitionList">
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Cr&eacute;er</p></td><td class="ebx_definitionListDefinition"><p>Un nouvel enregistrement peut &ecirc;tre cr&eacute;&eacute; &agrave; l&#39;aide du bouton &quot;+&quot; situ&eacute; en haut &agrave; gauche de la table. Un formulaire s&#39;affiche, permettant d&#39;entrer des donn&eacute;es. Les donn&eacute;es obligatoires sont rep&eacute;r&eacute;es par une ast&eacute;risque rouge.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>&Eacute;diter</p></td><td class="ebx_definitionListDefinition"><p>Un enregistrement peut &ecirc;tre &eacute;dit&eacute; en double-cliquant dessus. Le formulaire s&#39;affichant permet d&#39;&eacute;diter l&#39;enregistrement, tandis que le bouton <em>R&eacute;tablir</em> permet de recharger le formulaire sans soumettre aucun des changements effectu&eacute;s.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Dupliquer</p></td><td class="ebx_definitionListDefinition"><p>Un enregistrement qui a &eacute;t&eacute; s&eacute;lectionn&eacute; &agrave; l&#39;aide d&#39;une case &agrave; cocher peut &ecirc;tre dupliqu&eacute; gr&acirc;ce au bouton <em>Actions</em>.</p><p>Un formulaire apparaît avec les valeurs pr&eacute;-remplies &agrave; l&#39;image de l&#39;enregistrement copi&eacute;. La cl&eacute; primaire doit ensuite &ecirc;tre modifi&eacute;e pour pouvoir cr&eacute;er ce nouvel enregistrement, sauf si celle-ci est g&eacute;n&eacute;r&eacute;e (par exemple une valeur auto-incr&eacute;ment&eacute;e).</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Supprimer</p></td><td class="ebx_definitionListDefinition"><p>Un ou plusieurs enregistrements, ayant &eacute;t&eacute; s&eacute;lectionn&eacute;s &agrave; l&#39;aide des cases &agrave; cocher, peuvent &ecirc;tre supprim&eacute;s gr&acirc;ce au bouton <em>Actions</em>.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Comparer</p></td><td class="ebx_definitionListDefinition"><p>Deux enregistrements, ayant &eacute;t&eacute; s&eacute;lectionn&eacute;s &agrave; l&#39;aide des cases &agrave; cocher, peuvent &ecirc;tre compar&eacute;s &agrave; l&#39;aide du bouton <em>Actions</em>.</p><p><strong>Note :</strong> Le contenu des noeuds terminaux complexes, comme les listes aggr&eacute;g&eacute;es ou les attributs utilisateurs, ne sont pas compar&eacute;s pendant ce processus. Le service de comparaison ignore toutes les diff&eacute;rences entre les valeurs des noeuds terminaux complexes dans les enregistrements.</p></td></tr>
</table>
<h4>
Import/export d&#39;enregistrement</h4>
<p>Dans une table, les enregistrements peuvent &ecirc;tre import&eacute;s ou export&eacute;s, depuis ou vers des formats CSV ou XML.</p><p>Vous pouvez soit s&eacute;lectionner manuellement certains enregistrements &agrave; exporter, gr&acirc;ce aux cases &agrave; cocher, ou exporter l&#39;ensemble de la table.</p><div id="seealso">
<h5>
Voir aussi :</h5>
<ul>
<li><a target="_self" href="../references/csv_services.html">Services CSV</a></li><li><a target="_self" href="../references/xml_services.html">Services XML</a></li></ul>
</div>
<h3>
<a name="sort"></a>Tri des donn&eacute;es</h3>
<p>Un crit&egrave;re de tri contr&ocirc;le l&#39;ordre dans lequel les enregistrements sont pr&eacute;sent&eacute;s. Ils peuvent &ecirc;tre d&eacute;finis gr&acirc;ce au bouton <em>Vue</em>. L&#39;ordre par d&eacute;faut est par cl&eacute; primaire ascendante. L&#39;option <em>R&eacute;tablir</em> permet d&#39;annuler toute modification.</p><p>Il est d&eacute;fini par un nom de colonne et un ordre (ascendant, de la valeur la plus basse &agrave; la plus &eacute;lev&eacute;e, ou descendant, de la valeur la plus &eacute;lev&eacute;e &agrave; la plus faible). Un crit&egrave;re de tri peut &ecirc;tre ajout&eacute; et retir&eacute; &agrave; l&#39;aide des liens <em>Ajouter</em> et <em>Retirer</em>. L&#39;ordre de classement d&#39;un crit&egrave;re peut &ecirc;tre modifi&eacute; en cliquant sur les liens <em>ascendant</em> ou <em>descendant</em>.</p><p>L&#39;ordre entre les crit&egrave;res peut &ecirc;tre ajust&eacute; &agrave; l&#39;aide du bouton situ&eacute; &agrave; droite de la liste de crit&egrave;res.</p><h3>
<a name="search"></a>Recherche et filtrage des donn&eacute;es</h3>
<p>Il existe des outils sp&eacute;cifiques d&eacute;di&eacute;s &agrave; la recherche d&#39;enregistrements dans une table. On peut y acc&eacute;der par l&#39;ic&ocirc;ne <img alt="/ebx_search.png" src="../resources/images/symbols/ebx_search.png"></img>, qui affiche les panneaux des filtres.</p><p>Chaque panneau de filtre (ou de recherche) propose une case &agrave; cocher sur sa barre de titre&nbsp;:&nbsp;cocher cette case applique le filtre&nbsp;;&nbsp;la d&eacute;cocher le d&eacute;sapplique. Dans le reste de cette section, les diff&eacute;rents types de filtres disponibles sont d&eacute;taill&eacute;s.</p><fieldset class="ebx_note">
<legend>
<b>Note</b></legend>
Appliquer une vue personnalis&eacute;e reinitialisera et retirera tous les filtres appliqu&eacute;s.</fieldset>
<h4>
Recherche typ&eacute;e</h4>
<p>En mode simple, la recherche typ&eacute;e permet d&#39;ajouter des crit&egrave;res contextualis&eacute;s sur un ou plusieurs champs. Lors de l&#39;ajout d&#39;un crit&egrave;re les op&eacute;rateurs propos&eacute;s seront pertinents vis-&agrave;-vis du type du champ correspondant.</p><p>En activant le mode avanc&eacute;, il est possible de cr&eacute;er des sous-blocs contenants des crit&egrave;res, afin de cr&eacute;er des op&eacute;rations logiques plus complexes dans l&#39;&eacute;laboration du filtre.</p><h4>
<a name="textSearch"></a>Recherche textuelle</h4>
<p>La recherche textuelle est utilis&eacute;e pour une recherche de texte brut sur un ou plusieurs champs. Cette recherche ne prend pas en compte le type du champ.</p><ul>
<li><p>Si le texte entr&eacute; contient un ou plusieurs mots sans caract&egrave;re de remplacement (<code>*</code> ou <code>?</code>), les champs trouv&eacute;s seront ceux contenant tous ces mots. Les mots entre guillemets (&quot;aa bb&quot; par exemple) sont consid&eacute;r&eacute;s comme un seul mot.</p></li><li><p>Les caract&egrave;res usuels de remplacement sont propos&eacute;s&nbsp;:&nbsp;l&#39;&eacute;toile <code>*</code> (n&#39;importe quel texte) ou le point d&#39;interrogation <code>?</code> (n&#39;importe quel caract&egrave;re). Pour des raisons de performance, leur utilisation est restreinte &agrave; un seul de ces caract&egrave;res par recherche. </p></li><li><p>Les caract&egrave;res de remplacement peuvent &ecirc;tre consid&eacute;r&eacute;s comme de simple caract&egrave;res en les &eacute;chappant &agrave; l&#39;aide du caract&egrave;re &#39;\&#39;, par exemple, &#39;\*&#39;.</p></li></ul>
<p>Exemples :</p><ul>
<li><p><code>aa bb</code>&nbsp;:&nbsp;le champ contient &#39;aa&#39; et &#39;bb&#39;. </p></li><li><p><code>aa &quot;bb cc&quot;</code>&nbsp;:&nbsp;le champ contient &#39;aa&#39; et &#39;bb cc&#39;. </p></li><li><p><code>aa*</code>&nbsp;:&nbsp;le champ commence par &#39;aa&#39;. </p></li><li><p><code>*bb</code>&nbsp;:&nbsp;le champ se termine par &#39;bb&#39;. </p></li><li><p><code>aa*bb</code>&nbsp;:&nbsp;le champ commence par &#39;aa&#39; et se termine par &#39;bb&#39;. </p></li><li><p><code>aa?</code>&nbsp;:&nbsp;le champ commence par &#39;aa&#39; et a une taille de 3 caract&egrave;res. </p></li><li><p><code>?bb</code>&nbsp;:&nbsp;le champ se termine par &#39;bb&#39; et a une taille de 3 caract&egrave;res. </p></li><li><p><code>aa?bb</code>&nbsp;:&nbsp;le champ commence par &#39;aa&#39; et se termine par &#39;bb&#39; et a une taille de 5 caract&egrave;res. </p></li><li><p><code>aa\*bb</code>&nbsp;:&nbsp;le champ contient &#39;aa*bb&#39; tel quel. </p></li></ul>
<p> Sur les tables de grande taille, il est recommand&eacute; de ne s&eacute;lectionner qu&#39;un seul champ de la table&nbsp;;&nbsp;si le champ n&#39;est pas du type &#39;chaîne de caract&egrave;res&#39;, il est conseill&eacute; d&#39;entrer un texte au bon format, par exemple :</p><ul>
<li><p>Pour un bool&eacute;en&nbsp;:&nbsp;Oui, Non </p></li><li><p>Pour une date&nbsp;:&nbsp;01/01/2000 </p></li><li><p>Pour un nombre&nbsp;:&nbsp;100000 ou 100 000 </p></li><li><p>Pour un champ &eacute;num&eacute;r&eacute;&nbsp;:&nbsp;Rouge, Bleu.. </p></li></ul>
<p>Option <em>Sensible &agrave; la casse</em>&nbsp;:&nbsp;la recherche tient compte de la casse (majuscules et minuscules sont distinctes).</p><h4>
<a name="severitySearch"></a>Filtre par messages de validation</h4>
<p>Le filtre par messages de validation permet de voir les enregistrements en fonction de leur statut dans la derni&egrave;re validation effectu&eacute;e. Vous pouvez voir les enregistrements avec les niveaux &#39;Erreur&#39;, &#39;Avertissement&#39; et &#39;Information&#39;.</p><fieldset class="ebx_note">
<legend>
<b>Note</b></legend>
Cette recherche peut s&#39;appliquer seulement sur les enregistrements de la table qui ont d&eacute;j&agrave; &eacute;t&eacute; valid&eacute;s&nbsp;;&nbsp;pour cela, il faut s&eacute;lectionner <strong>Actions &gt; Valider</strong> au niveau de la table dans l&#39;espace de travail, ou au niveau du jeu de donn&eacute;es dans le panneau de navigation.</fieldset>
<h4>
<a name="specificSearch"></a>Recherches sp&eacute;cifiques sur tables</h4>
<p>Pour chaque table, le mod&egrave;le peut sp&eacute;cifier des filtres additionnels pour la recherche.</p><h3>
<a name="views"></a>Vues personnalis&eacute;es</h3>
<p>Vous pouvez personnaliser la pr&eacute;sentation d&#39;une table en appliquant ou en d&eacute;finissant des vues. En utilisant le bouton <em>Vue</em>, il est possible de s&eacute;lectionner une vue personnalis&eacute;e existante ou d&#39;en d&eacute;finir une nouvelle. Une fois une vue appliqu&eacute;e, elle peut &ecirc;tre d&eacute;finie comme la <em>vue par d&eacute;faut</em> pour la table. En cliquant sur <em>Enlever toutes les vues</em>, la vue par d&eacute;faut est r&eacute;tablie.</p><div id="seealsoShort">
<p><span style="color:#888888; font-size:13px; font-weight: bold;  margin:0 4px 0 0;">Voir aussi :</span><a target="_self" href="./view.html">Vues personnalis&eacute;es</a></p></div>
<p class="noPrint" align="right"><em><img alt="/ebx_search.png" src="../resources/images/symbols/ebx_search.png"></img><a target="_self" href="../table_contents_user.html"> Sommaire</a></em> du guide utilisateur</p><div id="ebx_breadcrumbBottom">
<span class="ebx_breadcrumbLabel">Documentation de EBX5 &gt; Guide utilisateur &gt; Jeux de données</span></div>
</div>
<p id="ebx_footer"><b>EBX5 Version 5.4.0 Fix 002 [0907:0001]. </b>Copyright &copy; <a href="http://www.orchestranetworks.com" target="_blank" style="text-decoration: none;">Orchestra Networks</a> 2000-2013. All rights reserved.<br></br>Trademarks and brand names referred to in this web site relating to organizations other than Orchestra Networks are the property of those organizations and Orchestra Networks makes no claims to such property.</p></div>
<script type="text/javaScript" src="../resources/yui/yahoo/yahoo-min.js">
</script>
<script type="text/javaScript" src="../resources/yui/event/event-min.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_doc_utils.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_simplePage.js">
</script>
<script type="text/javaScript">
var ie6CompatibilityCSSURL = "../resources/stylesheets/ebx_ie6_compatibility.css";</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_ie6_compatibility.js">
</script>
</body>
</html>
