<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<title>
EBX5 documentation - Interface utilisateur EBX5</title>
<meta content="text/html; charset=UTF-8" http-equiv="content-type"></meta><meta content="Copyright Orchestra Networks 2000-2013. All rights reserved." name="copyright"></meta><meta content="gui" name="doc_id"></meta><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_common.css"></link><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_docPage.css"></link><link rel="icon" type="image/x-icon" href="../resources/icons/brand.ico"></link></head>
<body class="ebx_simplePage">
<div id="ebx_centerer">
<div id="ebx_main">
<div id="printHeader">
<div class="productName">
EBX5</div>
<div class="chapterName">
Documentation &gt; Guide utilisateur &gt; Introduction</div>
</div>
<div id="ebx_breadcrumbTop">
<a id="ebx_navigationModeButton" href="../index.html?page=user_introduction/gui.html" title="Afficher cette page avec l'en-tête et les panneaux de navigation">Mode navigation</a><span class="ebx_breadcrumbLabel">Documentation &gt; Guide utilisateur &gt; Introduction</span></div>
<h1>
Interface utilisateur EBX5</h1>
<div id="toc">
<h4 id="tocTitle">
Contenu de la section</h4>
<ul class="toc1">
<li class="toc1"><a href="#id1">Pr&eacute;sentation</a></li><li class="toc1"><a href="#advanced_perspective">Perspective avanc&eacute;e</a></li><li class="toc1"><a href="#perspective">Perspectives</a></li><li class="toc1"><a href="#id4">Fonctionnalit&eacute;s de l&#39;interface utilisateur</a><ul class="toc2">
<li class="toc2"><a href="#id4s1">Cacher l&#39;en-t&ecirc;te</a></li><li class="toc2"><a href="#id4s2">R&eacute;initialiser la largeur du panneau de navigation</a></li></ul>
</li><li class="toc1"><a href="#id5">O&ugrave; trouver de l&#39;aide sur EBX5</a><ul class="toc2">
<li class="toc2"><a href="#id5s1">Aide contextuelle</a></li></ul>
</li></ul>
</div>
<h2>
<a name="id1"></a>Pr&eacute;sentation</h2>
<p>La mise en page g&eacute;n&eacute;rale des espaces de travail sur EBX5 est enti&egrave;rement personnalisable par un administrateur. Si des perspectives personnalis&eacute;es existent, elles peuvent &ecirc;tre s&eacute;lectionn&eacute;es via le menu d&eacute;roulant &#39;Perspective&#39; qui permet de passer d&#39;une vue &agrave; l&#39;autre.</p><p>La perspective avanc&eacute;e est accessible par d&eacute;faut. </p><div id="seealsoShort">
<p><span style="color:#808080; font-size:1.1em; font-family:'Source Sans Pro', Helvetica, Arial, sans-serif; font-weight: bold;  margin:0 4px 0 0;">Voir aussi</span><a href="../engine/admin_frontend.html">Front end administration</a></p></div>
<h2>
<a name="advanced_perspective"></a>Perspective avanc&eacute;e</h2>
<p>Par d&eacute;faut, la perspective avanc&eacute;e d&#39;EBX5 est accessible &agrave; tous les utilisateurs. Cependant, son acc&egrave;s peut &ecirc;tre restreint &agrave; certains profils uniquement. Cette vue est divis&eacute;e en plusieurs zones principales, r&eacute;f&eacute;renc&eacute;es dans la documentation sous les termes suivants:</p><ul>
<li><p><strong>En-t&ecirc;te</strong>&nbsp;:&nbsp;le nom de l&#39;utilisateur actuel s&#39;affiche dans cette zone, ainsi que le menu de s&eacute;lection de la langue (lorsque plusieurs sont disponibles), le menu de s&eacute;lection des perspectives (lorsque plusieurs sont disponibles), un lien vers la documentation et un bouton pour fermer la session en cours.</p></li><li><p><strong>Barre de menu</strong>&nbsp;:&nbsp;cette zone comprend toutes les fonctionnalit&eacute;s accessibles &agrave; l&#39;utilisateur actuel et lui permet de naviguer entre elles.</p></li><li><p><strong>Panneau de navigation</strong>&nbsp;:&nbsp;cette zone r&eacute;sume visuellement les diverses possibilit&eacute;s de navigation. Par exemple : s&eacute;lectionner une table dans un jeu de donn&eacute;es, ou un bon de travail dans un workflow.</p></li><li><p><strong>Espace de travail</strong>&nbsp;:&nbsp;zone de travail principale d&eacute;pendant du contexte. Par exemple, la table s&eacute;lectionn&eacute;e dans le panneau de navigation s&#39;affiche dans l&#39;espace de travail, ou bien un bon de travail en cours s&#39;y ex&eacute;cute.</p></li></ul>
<p>Les sections fonctionnelles suivantes sont affich&eacute;es dans l&#39;interface selon les permissions de l&#39;utilisateur actuel : <em>Donn&eacute;es</em>, <em>Espace de donn&eacute;es</em>, <em>Mod&eacute;lisation</em>, <em>Workflow de donn&eacute;es</em>, <em>Services de donn&eacute;es</em>, et <em>Administration</em>.</p><p align="left"><img alt="/UserInterface.png" src="../resources/images/user_introduction/UserInterface.png"></img></p><h2>
<a name="perspective"></a>Perspectives</h2>
<p> Les perspectives dans EBX5 sont des vues configurables avec une audience d&eacute;finie. Les perspectives permettent aux utilisateurs m&eacute;tier de b&eacute;n&eacute;ficier d&#39;une interface simplifi&eacute;e. Une perspective peut &ecirc;tre affect&eacute;e &agrave; un ou plusieurs profils. Cette vue est divis&eacute;e en plusieurs zones principales, r&eacute;f&eacute;renc&eacute;es dans la documentation sous les termes suivants:</p><ul>
<li><p><strong>En-t&ecirc;te </strong>: le nom de l&#39;utilisateur actuel s&#39;affiche dans cette zone, ainsi que le menu de s&eacute;lection de la langue (lorsque plusieurs sont disponibles), le menu de s&eacute;lection des perspectives (lorsque plusieurs sont disponibles) et un bouton pour fermer la session en cours.</p></li><li><p><strong>Panneau de navigation </strong>: cette zone affiche le menu hi&eacute;rarchique tel qu&#39;il a &eacute;t&eacute; configur&eacute; par l&#39;administrateur de perspectives. Ce panneau peut &ecirc;tre d&eacute;velopp&eacute; ou r&eacute;duit et permet d&#39;acc&eacute;der aux entit&eacute;s et services correspondant &agrave; l&#39;activit&eacute; de l&#39;utilisateur.</p></li><li><p><strong>Espace de travail </strong>: zone de travail principale d&eacute;pendant du contexte.</p></li></ul>
<p>Une perspective est configur&eacute;e par un utilisateur ayant les autorisations n&eacute;cessaires. Pour plus d&#39;informations sur la configuration d&#39;une perspective, voir <a href="../engine/admin_frontend.html#perspective">perspective administration (en anglais)</a>.</p><p>Exemple de pr&eacute;sentation d&#39;un menu hi&eacute;rarchique :</p><p align="left"><img alt="/perspectives.png" src="../resources/images/user_introduction/perspectives.png"></img></p><h2>
<a name="id4"></a>Fonctionnalit&eacute;s de l&#39;interface utilisateur</h2>
<h3>
<a name="id4s1"></a>Cacher l&#39;en-t&ecirc;te</h3>
<p>L&#39;en-t&ecirc;te de l&#39;interface utilisateur peut &ecirc;tre cach&eacute; en le survolant, puis en cliquant sur le bouton en forme de fl&egrave;che.</p><p><img alt="/hide_header.png" src="../resources/images/user_introduction/hide_header.png"></img></p><h3>
<a name="id4s2"></a>R&eacute;initialiser la largeur du panneau de navigation</h3>
<p>Si la largeur du panneau de navigation a &eacute;t&eacute; modifi&eacute;e, elle peut &ecirc;tre r&eacute;initialis&eacute;e en double-cliquant sur la bordure.</p><p><img alt="/navpanel_resize.png" src="../resources/images/user_introduction/navpanel_resize.png"></img></p><h2>
<a name="id5"></a>O&ugrave; trouver de l&#39;aide sur EBX5</h2>
<p>En plus de la documentation compl&egrave;te du produit, l&#39;aide est accessible de plusieurs fa&ccedil;ons dans l&#39;interface :</p><h3>
<a name="id5s1"></a>Aide contextuelle</h3>
<p>Lorsque la souris survole un &eacute;l&eacute;ment pour lequel une aide sp&eacute;cifique existe, un point d&#39;interrogation apparaît. En cliquant sur le point d&#39;interrogation, un panneau de documentation affiche les informations associ&eacute;es.</p><p><img alt="Panneau avec informations sur l'élément" src="../resources/images/user_introduction/documentation_pane.png"></img></p><p>Un bouton dans le coin sup&eacute;rieur gauche du panneau permet de r&eacute;cup&eacute;rer un permalien vers l&#39;&eacute;l&eacute;ment. Ce bouton n&#39;est pas disponible pour tous les types d&#39;&eacute;l&eacute;ment.</p><p><img alt="Panneau avec permalien" src="../resources/images/user_introduction/documentation_pane2.png"></img></p><p class="noPrint" align="right"><em><img alt="/ebx_search.png" src="../resources/images/symbols/ebx_search.png"></img><a href="../table_contents_user.html">Sommaire</a></em> du guide utilisateur</p><div id="ebx_breadcrumbBottom">
<span class="ebx_breadcrumbLabel">Documentation &gt; Guide utilisateur &gt; Introduction</span></div>
</div>
<p id="ebx_footer"><b>EBX5 Version 5.6.1 Fix A [0985:0003]. </b>Copyright &copy; <a href="http://www.orchestranetworks.com" target="_blank" style="text-decoration: none;">Orchestra Networks</a> 2000-2015. All rights reserved.<br></br>Trademarks and brand names referred to in this web site relating to organizations other than Orchestra Networks are the property of those organizations and Orchestra Networks makes no claims to such property.</p></div>
<script type="text/javaScript" src="../resources/yui/yahoo/yahoo-min.js">
</script>
<script type="text/javaScript" src="../resources/yui/event/event-min.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_doc_utils.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_simplePage.js">
</script>
<script type="text/javaScript">
var ie6CompatibilityCSSURL = "../resources/stylesheets/ebx_ie6_compatibility.css";</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_ie6_compatibility.js">
</script>
</body>
</html>
